export const rules = [
  {
    regex: /เวลาเปิด(ทำการ)?|เปิดกี่โมง|เวลาปิด(ทำการ)?|ปิดกี่โมง/i, // ค้นหา "เวลาเปิด" หรือ "เปิดกี่โมง"
    handler: async () => {
      return {
        message: "ร้านเปิดทำการทุกวันตั้งแต่ 7:00 น. ถึง 20:00 น.",
      };
    },
  },
  {
    regex: /ที่อยู่|location/i, // ค้นหา "ที่อยู่" หรือ "location"
    handler: async () => {
      return {
        message:
          "ร้านตั้งอยู่ที่ 109 ถนนประชานิยม ตำบลบ้านโป่ง อำเภอบ้านโป่ง จังหวัดราชบุรี 70110",
      };
    },
  },
  {
    regex: /เบอร์โทรศัพท์|โทร/i, // ค้นหา "เบอร์โทรศัพท์" หรือ "โทร"
    handler: async () => {
      return {
        message: "คุณสามารถติดต่อร้านได้ที่หมายเลข 032-211-856",
      };
    },
  },
  {
    regex: /ค่าส่ง|จัดส่ง|ส่งของ|ส่งกี่วัน/i, // ค้นหา "ค่าส่ง" หรือ "จัดส่ง"
    handler: async () => {
      return {
        message:
          "ค่าจัดส่งจะเริ่มต้นที่ 40 บาท โดยจะคิดตามน้ำหนักและขนาดของสินค้า และใช้เวลาจัดส่งประมาณ 2-3 วันทำการค่ะ",
      };
    },
  },
  {
    regex: /ชำระเงิน|จ่ายเงิน|เก็บเงินปลายทาง|โอนเงิน/i,
    handler: async () => {
      return {
        message:
          "ทางร้านรับชำระเงินหลายช่องทางครับ/ค่ะ ทั้งการโอนเงิน, บัตรเครดิต, และมีบริการเก็บเงินปลายทางด้วยค่ะ",
      };
    },
  },
  {
    regex: /เปลี่ยน(สินค้า|ของ)|คืนของ|เปลี่ยนไซส์/i,
    handler: async () => {
      return {
        message:
          "หากสินค้ามีปัญหาหรือใส่ไม่ได้ สามารถเปลี่ยนไซส์ได้ภายใน 7 วันค่ะ โดยสินค้าต้องอยู่ในสภาพเดิมและยังไม่ผ่านการใช้งาน",
      };
    },
  },
  {
    regex:/ปักชื่อ|ปักตรา|ปักชุด/i,
    handler: async () => {
      return {
        message:
          "ทางร้านมีบริการปักชื่อหรือปักตราให้กับเสื้อผ้าทุกชิ้น โดยจะใช้เวลาประมาณ 3-5 วันทำการในการดำเนินการค่ะ",
      };
    },
  },
  {
    regex:/สวัสดี|hello/i,
    handler: async () => {
      return {
        message:
          "สวัสดีค่ะ! ยินดีต้อนรับสู่ร้านของเรา มีอะไรให้ช่วยเหลือคะ?",
      };
    },
  }
];

